In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# Dataframe is basically multiple series that share the same index

In [3]:
# creating some dataframe with random normal data

data = np.random.randn(5, 4)
cols = ['A', 'B', 'C', 'D']

# creating dataframe (df) by seperatly passing data and column names
# we can also create dataframe using python dictionary
df = pd.DataFrame(data = data, columns=cols)

In [4]:
# cols A, B, C, D are Series object that share the same index
df

          A         B         C         D
0  0.498831  0.305847 -0.635084  1.065679
1 -2.373496 -0.440492 -0.371492 -0.096536
2 -0.456124 -0.508238  0.101918 -0.967778
3  0.222172 -0.788676  2.502496  0.455068
4 -0.921290  0.180667 -1.054489 -1.358574

In [5]:
# Manually assigning index

index = 'U V W X Y'.split()

df.index = index

In [6]:
df

          A         B         C         D
U  0.498831  0.305847 -0.635084  1.065679
V -2.373496 -0.440492 -0.371492 -0.096536
W -0.456124 -0.508238  0.101918 -0.967778
X  0.222172 -0.788676  2.502496  0.455068
Y -0.921290  0.180667 -1.054489 -1.358574

In [7]:
# Now accessing a particular column
# it is just like python dictionary
df['A']

U    0.498831
V   -2.373496
W   -0.456124
X    0.222172
Y   -0.921290
Name: A, dtype: float64

In [8]:
# Now accessing multiple columns

df[ ['A', 'B', 'D'] ]

          A         B         D
U  0.498831  0.305847  1.065679
V -2.373496 -0.440492 -0.096536
W -0.456124 -0.508238 -0.967778
X  0.222172 -0.788676  0.455068
Y -0.921290  0.180667 -1.358574

In [9]:
# Creating new column 

# it will create new column called E and will do elementwise sum of cols A and B 
df['E'] = df['A'] + df['B']

In [10]:
df

          A         B         C         D         E
U  0.498831  0.305847 -0.635084  1.065679  0.804677
V -2.373496 -0.440492 -0.371492 -0.096536 -2.813988
W -0.456124 -0.508238  0.101918 -0.967778 -0.964362
X  0.222172 -0.788676  2.502496  0.455068 -0.566504
Y -0.921290  0.180667 -1.054489 -1.358574 -0.740623

In [11]:
# Now deleting a column

# by default it is set to delete rows ( i.e axis = 0 ), if you want to delete column set (axis = 1)
# also this will return new dataframe with E column removed, inorder to do it in same dataframe set inplace=True
df.drop('E', axis = 1, inplace = True)

In [12]:
df

          A         B         C         D
U  0.498831  0.305847 -0.635084  1.065679
V -2.373496 -0.440492 -0.371492 -0.096536
W -0.456124 -0.508238  0.101918 -0.967778
X  0.222172 -0.788676  2.502496  0.455068
Y -0.921290  0.180667 -1.054489 -1.358574

In [13]:
# For deleting particular row 
# say Xth row

# by default it is set to axis = 0
df.drop('X', inplace = True)

In [14]:
df

          A         B         C         D
U  0.498831  0.305847 -0.635084  1.065679
V -2.373496 -0.440492 -0.371492 -0.096536
W -0.456124 -0.508238  0.101918 -0.967778
Y -0.921290  0.180667 -1.054489 -1.358574

In [15]:
# Now we know how to access col, add col, drop col and drop row

# Now accessing particular row
df.loc['U']

A    0.498831
B    0.305847
C   -0.635084
D    1.065679
Name: U, dtype: float64

In [16]:
# accessing multiple rows
df.loc[ ['U', 'Y'] ]

          A         B         C         D
U  0.498831  0.305847 -0.635084  1.065679
Y -0.921290  0.180667 -1.054489 -1.358574

In [17]:
# Now instead of accessing row by index name, we can access by integer index

# iloc means integer based location
# it will return 0th and 2nd row
df.iloc[ [0, 2] ]

          A         B         C         D
U  0.498831  0.305847 -0.635084  1.065679
W -0.456124 -0.508238  0.101918 -0.967778

In [18]:
# Now accessing subset of data
# selecting A, B column and U, W row

# This will select first U, W row and this will return dataframe and then finally selecting A and B column
df.loc[ ['U', 'W'] ][ ['A', 'B'] ]

          A         B
U  0.498831  0.305847
W -0.456124 -0.508238

In [19]:
# Another way of doing this

# this is numpy like indexing  first rows, columns
df.loc[ ['U', 'W'], ['A', 'B'] ]

          A         B
U  0.498831  0.305847
W -0.456124 -0.508238

In [20]:
# Now performing some conditions on dataframe

# this will return boolean of dataframe
df > 0

       A      B      C      D
U   True   True  False   True
V  False  False  False  False
W  False  False   True  False
Y  False   True  False  False

In [21]:
# now getting values with this condition

# it will return values where df > 0, ( broadcasting is done here )
df[ df > 0 ]

          A         B         C         D
U  0.498831  0.305847       NaN  1.065679
V       NaN       NaN       NaN       NaN
W       NaN       NaN  0.101918       NaN
Y       NaN  0.180667       NaN       NaN

In [22]:
# applying condition on specific column, and most of the times we will be doing that :D

df['A'] > 0

U     True
V    False
W    False
Y    False
Name: A, dtype: bool

In [23]:
# selecting all the rows where value of A > 0
df[ df['A'] > 0 ]

          A         B         C         D
U  0.498831  0.305847 -0.635084  1.065679

In [24]:
# if you want particular column

df[ df['A'] > 0 ][ ['A', 'C'] ]

          A         C
U  0.498831 -0.635084

In [25]:
# applying mulitple conditions on dataframe
# and it is pandas requires that you keep all the conditions in the brackets
# df[ df['A'] < 0 & df['C'] < 0 ] -> this will return error as there are no brackets

# selecting all cols where A < 0 and C < 0; 
df[ (df['A'] < 0) & (df['C'] < 0) ]

          A         B         C         D
V -2.373496 -0.440492 -0.371492 -0.096536
Y -0.921290  0.180667 -1.054489 -1.358574

In [26]:
# selecting all cols where A < 0 or C < 0; 

df[ (df['A'] < 0) | (df['C'] < 0) ]

          A         B         C         D
U  0.498831  0.305847 -0.635084  1.065679
V -2.373496 -0.440492 -0.371492 -0.096536
W -0.456124 -0.508238  0.101918 -0.967778
Y -0.921290  0.180667 -1.054489 -1.358574

In [28]:
# now if you want to create the current index as a column
# by default it will create that new columns and name it as index
df.reset_index(inplace = True)

In [29]:
df

  index         A         B         C         D
0     U  0.498831  0.305847 -0.635084  1.065679
1     V -2.373496 -0.440492 -0.371492 -0.096536
2     W -0.456124 -0.508238  0.101918 -0.967778
3     Y -0.921290  0.180667 -1.054489 -1.358574

In [30]:
# inorder to create a column as index
# setting the index column as index of df
df.set_index(df['index'], inplace = True)

In [31]:
df

      index         A         B         C         D
index
U         U  0.498831  0.305847 -0.635084  1.065679
V         V -2.373496 -0.440492 -0.371492 -0.096536
W         W -0.456124 -0.508238  0.101918 -0.967778
Y         Y -0.921290  0.180667 -1.054489 -1.358574

In [32]:
df.drop('index', axis = 1, inplace = True)

In [33]:
df

              A         B         C         D
index
U      0.498831  0.305847 -0.635084  1.065679
V     -2.373496 -0.440492 -0.371492 -0.096536
W     -0.456124 -0.508238  0.101918 -0.967778
Y     -0.921290  0.180667 -1.054489 -1.358574

In [34]:
# now getting some information about dataframe

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, U to Y
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      float64
 2   C       4 non-null      float64
 3   D       4 non-null      float64
dtypes: float64(4)
memory usage: 160.0+ bytes

In [35]:
# the more descriptive stats 
df.describe()

              A         B         C         D
count  4.000000  4.000000  4.000000  4.000000
mean  -0.813020 -0.115554 -0.489787 -0.339302
std    1.196542  0.418374  0.484461  1.074989
min   -2.373496 -0.508238 -1.054489 -1.358574
25%   -1.284341 -0.457428 -0.739935 -1.065477
50%   -0.688707 -0.129912 -0.503288 -0.532157
75%   -0.217385  0.211962 -0.253140  0.194018
max    0.498831  0.305847  0.101918  1.065679

In [36]:
# adding one categorical column to show some more useful and commonly used methods

df['categorical'] = ['first_category'] * 1 + ['second_category'] * 3

In [37]:
df

              A         B         C         D      categorical
index
U      0.498831  0.305847 -0.635084  1.065679   first_category
V     -2.373496 -0.440492 -0.371492 -0.096536  second_category
W     -0.456124 -0.508238  0.101918 -0.967778  second_category
Y     -0.921290  0.180667 -1.054489 -1.358574  second_category

In [38]:
# now getting the count of each category
df['categorical'].value_counts()

second_category    3
first_category     1
Name: categorical, dtype: int64

In [39]:
# Now dealing with missing data
# You can fill the missing data by 3 ways
# 1) keep the missing data as it is, if the forecasting algorithms can handle it
# 2) drop the entire sample, including the timestamp
# 3) replace it with the best estimate ( can differ based on problem, can use mean, median, or any method u r comformtable with )

# but fortunately most of the time series datasets will do not contain missing values
# as data is entered and timestamped

nan_df = pd.DataFrame({'A': [1, 2, np.nan, 4], 'B': [5, np.nan, 7, np.nan]})
nan_df

     A    B
0  1.0  5.0
1  2.0  NaN
2  NaN  7.0
3  4.0  NaN

In [40]:
# dropping all the rows containing nan values
nan_df.dropna()

     A    B
0  1.0  5.0

In [41]:
# to drop the column containing nan values, it will drop all the columns in this df :|
nan_df.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [42]:
# now dropping rows if and only if it contains 'k' number of nan's
# here k = 2, means if row contains atleast 2 nan's then only drop that row
nan_df.dropna(thresh=2)

     A    B
0  1.0  5.0

In [43]:
# filling it with some estimate like mean
nan_df.fillna(value = nan_df.mean())

          A    B
0  1.000000  5.0
1  2.000000  6.0
2  2.333333  7.0
3  4.000000  6.0

In [44]:
# Now using groupby
# this is basically splitting first based on some column, then aggregating by some function like mean, sum, etc

df

              A         B         C         D      categorical
index
U      0.498831  0.305847 -0.635084  1.065679   first_category
V     -2.373496 -0.440492 -0.371492 -0.096536  second_category
W     -0.456124 -0.508238  0.101918 -0.967778  second_category
Y     -0.921290  0.180667 -1.054489 -1.358574  second_category

In [45]:
# now this will split by categorical column and then aggregating by mean 
df.groupby('categorical').mean()

                        A         B         C         D
categorical
first_category   0.498831  0.305847 -0.635084  1.065679
second_category -1.250303 -0.256021 -0.441354 -0.807629

In [46]:
# instead, since the returned is dataframe only, use describe function simply :D
df.groupby('categorical').describe()

                    A                                                    \
                count      mean       std       min       25%       50%
categorical
first_category    1.0  0.498831       NaN  0.498831  0.498831  0.498831
second_category   3.0 -1.250303  1.000133 -2.373496 -1.647393 -0.921290

                                        B            ...         C            \
                      75%       max count      mean  ...       75%       max
categorical                                          ...
first_category   0.498831  0.498831   1.0  0.305847  ... -0.635084 -0.635084
second_category -0.688707 -0.456124   3.0 -0.256021  ... -0.134787  0.101918

                    D                                                    \
                count      mean       std       min       25%       50%
categorical
first_category    1.0  1.065679       NaN  1.065679  1.065679  1.065679
second_category   3.0 -0.807629  0.646081 -1.358574 -1.163176 -0.967778


                      75%       max
categorical
first_category   1.065679  1.065679
second_category -0.532157 -0.096536

[2 rows x 32 columns]

In [47]:
# the above will be more intuitive if we transposed it
df.groupby('categorical').describe().transpose()

categorical  first_category  second_category
A count            1.000000         3.000000
  mean             0.498831        -1.250303
  std                   NaN         1.000133
  min              0.498831        -2.373496
  25%              0.498831        -1.647393
  50%              0.498831        -0.921290
  75%              0.498831        -0.688707
  max              0.498831        -0.456124
B count            1.000000         3.000000
  mean             0.305847        -0.256021
  std                   NaN         0.379697
  min              0.305847        -0.508238
  25%              0.305847        -0.474365
  50%              0.305847        -0.440492
  75%              0.305847        -0.129912
  max              0.305847         0.180667
C count            1.000000         3.000000
  mean            -0.635084        -0.441354
  std                   NaN         0.581360
  min             -0.635084        -1.054489
  25%             -0.635084        -0.712991
  50%             -0.635084        -0.371492
  75%             -0.635084        -0.134787
  max             -0.635084         0.101918
D count            1.000000         3.000000
  mean             1.065679        -0.807629
  std                   NaN         0.646081
  min              1.065679        -1.358574
  25%              1.065679        -1.163176
  50%              1.065679        -0.967778
  75%              1.065679        -0.532157
  max              1.065679        -0.096536

In [48]:
# Now performing some most common operations on dataframe

In [49]:
# getting all the unique values of the column
df['categorical'].unique()

array(['first_category', 'second_category'], dtype=object)

In [50]:
# now getting the number of unique values of column
df['categorical'].nunique()

2

In [51]:
# alternatively you could do
df['categorical'].value_counts()

second_category    3
first_category     1
Name: categorical, dtype: int64

In [52]:
# now one of the important method
# suppose we want to apply some operation on particular column

# say double the values of column A
def double_value(x):
    return 2 * x

df['A'].apply(double_value)

index
U    0.997661
V   -4.746992
W   -0.912247
Y   -1.842580
Name: A, dtype: float64

In [53]:
# creating new column
df['double_A'] = df['A'].apply(double_value)

In [54]:
# we can also do lambda functions
df['double_B'] = df['B'].apply(double_value)

In [55]:
df

,A,B,C,D,categorical,double_A,double_B
index,,,,,,,
U,0.498831,0.305847,-0.635084,1.065679,first_category,0.997661,0.611693
V,-2.373496,-0.440492,-0.371492,-0.096536,second_category,-4.746992,-0.880984
W,-0.456124,-0.508238,0.101918,-0.967778,second_category,-0.912247,-1.016476
Y,-0.921290,0.180667,-1.054489,-1.358574,second_category,-1.842580,0.361334

In [56]:
# new way of permanantly deleting column from dataframe

del df['double_A']

In [57]:
del df['double_B']

In [58]:
df

              A         B         C         D      categorical
index
U      0.498831  0.305847 -0.635084  1.065679   first_category
V     -2.373496 -0.440492 -0.371492 -0.096536  second_category
W     -0.456124 -0.508238  0.101918 -0.967778  second_category
Y     -0.921290  0.180667 -1.054489 -1.358574  second_category

In [59]:
# Now sorting the column based on some column

df.sort_values('A')

              A         B         C         D      categorical
index
V     -2.373496 -0.440492 -0.371492 -0.096536  second_category
Y     -0.921290  0.180667 -1.054489 -1.358574  second_category
W     -0.456124 -0.508238  0.101918 -0.967778  second_category
U      0.498831  0.305847 -0.635084  1.065679   first_category

In [60]:
# by default it is ascending, for descending

df.sort_values('A', ascending=False)

              A         B         C         D      categorical
index
U      0.498831  0.305847 -0.635084  1.065679   first_category
W     -0.456124 -0.508238  0.101918 -0.967778  second_category
Y     -0.921290  0.180667 -1.054489 -1.358574  second_category
V     -2.373496 -0.440492 -0.371492 -0.096536  second_category